# +STARTUP: showall

* R2021 CURRICULUM
#+name: curriculum
{{{curriculum-table}}}
| <5> | <9>  | <50>                                                      | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code | Title                                                     | Cat | Hrs |   L |   T |   P |   E |   C |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester I*                                              |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Technical English                                         | HS  |   4 |   2 |   0 |   2 |     |   3 |
|   2 |      | Matrices and Calculus                                     | BS  |   4 |   3 |   1 |   0 |     |   4 |
|   3 |      | Engineering Physics                                       | BS  |   3 |   3 |   0 |   0 |     |   3 |
|   4 |      | Engineering Chemistry                                     | BS  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Problem Solving and Programming in Python                 | ES  |   3 |   3 |   0 |   0 |     |   3 |
|   6 |      | Engineering Graphics                                      | ES  |   5 |   1 |   0 |   4 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Physics and Chemistry Lab                                 | BS  |   3 |   0 |   0 |   3 |     | 1.5 |
|   8 |      | Programming in Python Lab                                 | ES  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  28 |  15 |   1 |  12 |   0 | 22. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester II*                                             |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Complex Functions and Laplace Transforms                  | BS  |   4 |   3 |   1 |   0 |     |   4 |
|   2 |      | Basic Electrical and Electronics Engineering              | ES  |   3 |   3 |   0 |   0 |     |   3 |
|   3 |      | Fundamentals and Practice of Software Development (TCP b) | ES  |   8 |   2 |   0 |   3 |   3 | 4.5 |
|   4 |      | Environmental Science                                     | BS  |   3 |   3 |   0 |   0 |     |   0 |
|   5 |      | Humanities Elective I                                     | HS  |   3 |   3 |   0 |   0 |     |   3 |
|   6 |      | Foundations of Data Science                               | ES  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Design Thinking and Engineering Practices Lab             | ES  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  27 |  17 |   1 |   6 |   3 | 19. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester III*                                            |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Discrete Mathematics                                      | BS  |   4 |   3 |   1 |   0 |     |   4 |
|   2 |      | Universal Human Values II                                 | HS  |   3 |   3 |   0 |   0 |     |   3 |
|   3 |      | Digital Principles and System Design                      | ES  |   3 |   3 |   0 |   0 |     |   3 |
|   4 |      | Data Structures                                           | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Object Oriented Programming                               | PC  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   6 |      | Digital Design Lab                                        | ES  |   3 |   0 |   0 |   3 |     | 1.5 |
|   7 |      | Data Structures Lab                                       | PC  |   4 |   0 |   0 |   4 |     |   2 |
|   8 |      | Object Oriented Programming Lab                           | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  26 |  15 |   1 |  10 |   0 | 21. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester IV*                                             |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Probability and Statistical Methods                       | BS  |   4 |   3 |   1 |   0 |     |   4 |
|   2 |      | Indian Constitution                                       | HS  |   3 |   3 |   0 |   0 |     |   0 |
|   3 |      | Computer Organization and Architecture                    | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   4 |      | Operating Systems                                         | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Design and Analysis of Algorithms (TCP a)                 | PC  |   5 |   3 |   0 |   2 |     |   4 |
|   6 |      | Database Management Systems                               | PC  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Operating Systems Lab                                     | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|   8 |      | Database Lab                                              | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  27 |  18 |   1 |   8 |   0 | 20. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester V*                                              |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Computer Networks                                         | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   2 |      | Microprocessors, microcontrollers, and Interfacing        | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   3 |      | Artificial Intelligence (TCP a)                           | PC  |   5 |   3 |   0 |   2 |     |   4 |
|   4 |      | Software Engineering                                      | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Professional Elective 1                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 |      | Management Elective                                       | HS  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Networks Lab                                              | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|   8 |      | Microprocessors Lab                                       | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  26 |  18 |   0 |   8 |   0 | 22. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester VI*                                             |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Internet Programming                                      | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   2 |      | Software System Security                                  | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   3 |      | Machine Learning                                          | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   4 |      | Theory of Computation                                     | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Professional Elective 2                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 |      | Open Elective 1                                           | OE  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Internet Programming Lab                                  | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|   8 |      | Machine Learning Lab                                      | PC  |   3 |   0 |   0 |   3 |     | 1.5 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  24 |  18 |   0 |   6 |   0 | 21. |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester VII*                                            |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Distributed Systems                                       | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   2 |      | Software Architecture                                     | PC  |   3 |   3 |   0 |   0 |     |   3 |
|   3 |      | Compiler Design (TCP a)                                   | PC  |   5 |   3 |   0 |   2 |     |   4 |
|   4 |      | Professional Elective 3                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 |      | Professional Elective 4                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 |      | Professional Elective 5                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   7 |      | Project Work Phase I                                      | EEC |   6 |   0 |   0 |   6 |     |   3 |
|   8 |      | Industrial Training / Internship                          | EEC |   0 |   0 |   0 |   0 |     |   2 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | /Total/                                                   |     |  26 |  18 |   0 |   8 |   0 |  24 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Semester VIII*                                           |     |     |     |     |     |     |     |
|     |      | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |      | Professional Elective 6                                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 |      | Open Elective 2                                           | OE  |   3 |   3 |   0 |   0 |     |   3 |
|     |      | /Practical/                                               |     |     |     |     |     |     |     |
|   3 |      | Project Work Phase II                                     | EEC |  16 |   0 |   0 |  16 |     |   8 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | Total                                                     |     |  22 |   6 |   0 |  16 |   0 |  14 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Grand Total*                                             |     |     |     |     |     |     | 163 |
|-----+------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
#+TBLFM: @14$5..@14$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @25$5..@25$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @37$5..@37$>=vsum(@-II+3..@-5)+vsum(@-3..@-1)
#+TBLFM: @49$5..@49$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @61$5..@61$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @73$5..@73$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @85$5..@85$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @92$5..@92$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @93$10=@III+1+@IIIII+1+@IIIIIII+1+@IIIIIIIII+1+@IIIIIIIIIII+1+@IIIIIIIIIIIII+1+@IIIIIIIIIIIIIII+1+@IIIIIIIIIIIIIIIII+1;%3d

{{{clrpage}}}
{{{curriculum-table}}}
| <5> | <9>   | <50>                                      | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code  | Title                                     | Cat | Hrs |   L |   T |   P | E   |   C |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 1*                 |     |     |     |     |     |     |     |
|   1 | PE001 | Mathematics for Machine Learning [fn:1]   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE101 | Big Data Technologies                     | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE102 | Software Testing                          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE103 | Image Processing and Analysis             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE104 | Logic Programming                         | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE105 | UNIX Internals                            | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE106 | Ethical Hacking                           | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   8 | PE107 | Advanced Database Management Systems      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 2*                 |     |     |     |     |     |     |     |
|   1 | PE201 | Cloud Computing                           | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE202 | Big Data Management                       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE203 | Software Configuration Management         | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE204 | Probabilistic Graphical Models            | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE205 | Natural Language Processing               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE206 | Cyber Forensics                           | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE207 | Internet of Things                        | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 3*                 |     |     |     |     |     |     |     |
|   1 | PE301 | Bayesian Data Analysis                    | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE302 | Wireless and Adhoc Networks               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE303 | Object Oriented Analysis and Design       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE304 | Soft Computing                            | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE305 | Deep Learning                             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE306 | Multicore Architectures and GPU Computing | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE307 | Network and Server Security               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 4*                 |     |     |     |     |     |     |     |
|   1 | PE401 | Healthcare  Analytics                     | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE402 | User Experience Design                    | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE403 | Social Network Analysis                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE404 | Reinforcement Learning                    | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE405 | Blockchain Technologies                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE406 | Embedded systems                          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE407 | Computer Graphics and Multimedia          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 5*                 |     |     |     |     |     |     |     |
|   1 | PE501 | Business Analytics                        | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE502 | Agile Methodologies                       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE503 | Time Series Analysis and Forecasting      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE504 | Computer Vision                           | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE505 | Speech Processing and Synthesis           | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE506 | Mobile Computing                          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE507 | Mobile and Wireless Security              | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |       | *Professional Elective 6*                 |     |     |     |     |     |     |     |
|   1 | PE601 | Bioinformatics Technologies               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | PE602 | Formal System Verification                | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | PE603 | Service Oriented Architecture             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | PE604 | Information Retrieval Techniques          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | PE605 | Introduction to Robotics                  | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | PE606 | Software Defined Networks                 | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | PE607 | Parallel Algorithms                       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+-------+-------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
[fn:1] Only for students of Honours degree


{{{clrpage}}}
{{{curriculum-table}}}
| <5> | <9>  | <50>                                   | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code | Title                                  | Cat | Hrs |   L |   T |   P | E   |   C |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Open Electives 1*                     |     |     |     |     |     |     |     |
|   1 | OE1  | Introduction to Data Structures        | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   2 | OE2  | Object Oriented Programming Techniques | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   3 | OE3  | Problem Solving and Programming in C   | OE  |   4 |   2 |   0 |   2 |     |   3 |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Open Electives 2*                     |     |     |     |     |     |     |     |
|   4 | OE4  | Introduction to Big Data Analytics     | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   5 | OE5  | Machine Learning Applications          | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   6 | OE6  | Web Technology                         | OE  |   4 |   2 |   0 |   2 |     |   3 |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|

* SPECIALIZATION
{{{specialization-table}}}
| <10> | <30>                                                      | <30>                                                                  | <30>                                                                                    |
|   PE | /Software Engineering/                                    | /Systems and Security/                                                | /AI and Machine Learning/                                                               |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    1 | Big Data Technologies, Software Testing                   | UNIX Internals, Ethical Hacking                                       | Mathematics for Machine Learning, Image Processing and Analysis, Logic Programming      |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    2 | Big Data Management, Software Configuration Management    | Cloud Computing, Cyber Forensics, Internet of Things                  | Probablistic Graphical Models, Natural Language Processing                              |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    3 | Object Orineted Analysis and Design                       | Multicore Architecture and GPU Computing, Network and Server Security | Bayesian Data Analysis, Soft Computing, Deep Learning                                   |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    4 | User Experience Design                                    | Blockchain Technologies, Embedded systems                             | Social Network Analysis, Reinforcement Learning                                         |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    5 | Agile Methodologies                                       | Mobile Computing, Mobile and Wireless Security                        | Time Series Analysis and Forecasting, Computer Vision, Speech Processing and Synthesis  |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    6 | Formal System Verification, Service Oriented Architecture | Software Defined Networks                                             | Bioinformatics Technologies, Information Retrieval Techniques, Introduction to Robotics |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
